final class Variant2 {
    static final String CAESAR_CIPHER = "Их т йят цщґчішс, йтш їбй ьщащчщх яційшсг ріьщющпґтй т чій бйняж гсяа, йяз йющмб ріьщющржхб. Йсящхсф, дщюшийсф аі хбднюийсф!";
    static final String CAESAR_EXPECTED = "Як і всі лоцмани, він був потомок славних запорожців і мав увесь хист, всю вроду запорозьку. Високий, чорнявий та кучерявий!";
    static final String VIGENERE_CIPHER = "Вцмвриґсб клйд, у сиьб ґатсчстизшюх вьізтинщзтеш ізимсажичясй крхьиоаькериґчяв є яіторач уиплмвовхг тіт, іщ де мцяиятї тдфовчсціч ьжо вьізнищі, иомд йян нс чеже гціжиґс ьасаїем адачнтхвякажта. Ця ніца сґіга пвслиназ єоянс яєрлюйічяща сигачми гнжтиетваццу уідщюютиє хгючцй.";
    static final String VIGENERE_KEY = "аліса";
    static final String VIGENERE_EXPECTED = "Відкритий ключ, в силу математичних властивостей асиметричних криптоалгоритмів є набором випадкових біт, що не містять інформації про власника, тому він не може служити засобом аутентифікації. Ця вада стала причиною появи ієрархічної системи сертифікації відкритих ключів.";
    static final String HINT_CIPHER = "Бмлдяц бьй южьаебчез жсвт ивсцд птлдцшїиз Лле Дтцць 1984 лшга. Нсї щзрбамяяї, іш чфур ф'зьрґигз ішьххїеюіє нрзшзргяйїїїляд зг їцлзьяяху зхрґ цц'ч иуш бшуяєїд иаьшюд Иисир, ґш см жшфішїяха і мфґирчо щзшжмааза лїнмеяхбефтгцт щачє-кфййє юсчма. Чшнйду миг самс Длцеьт плхддтхлюч хядс флиирншц фзрбяййзиестчєж ошишфшьшіфєж, лхб ї 2000 зшжс, ґифлкфд шччцу ьсчшюсж їзифхдїєюґс ь мґсбядґесш флржяайлийсч, самр їриишиз няехяях ї гріяк.";
    static final String HINT_KEY = "лишити";
    static final String HINT_PREFIX = "Першим про спрощення";
    static final String DECIMAL_CIPHER = "87935393740778315385627989273";
    static final String DECIMAL_KEY = "лис";
    private Variant2() {}
}
